import random
hp = 100
hp2 = 100
rec = 10
a=input('Придумайте себе никнейм или напишите <<random>> для автоматического подбора\
	\n')
if a == 'random':
	a = random.choice([' Паша', ' Михаил', ' Максим'])
	
print('--------------------------------------------------------------')
print('Добро пожаловать в игру inside the backrooms ' + a ) 
print('--------------------------------------------------------------')
lvl=input('Выберете сложность: Легкая, Средняя, Сложная \
	\n')
if lvl == 'Лёгкая' or lvl=='Легкая' or lvl=='лёгкая' or lvl=='легкая':
	hp=250
	hp2=100
	a=0
	b=10
	y= 0
	y2= 0
	while hp>0 or hp2>0:
		y=y+1
		print('Попытка №'+str(y))
		damage = random.randint (a,b)
		defense = int(input('Для отрожения атаки укажите уровень защиты от 1-'+str(b)+'\
			\n')) 
		if defense < b:
			print('Ошибка 05')
			hp = -1
			hp2 = -1

		if defense!=damage:
			hp = hp-damage
			print('Вы не смогли защититься от монстра, он нанёс вам:' +str(damage)+'\
			\nу вас осталось:' +str(hp)+'хп\
			\n')
		elif defense == damage:
			hp = hp+damage
			print('Вы смогли защититься от монтсра, вы выпили \
				\nтаблетки и изличились на:' +str(damage)+'\
			\nу вас стало:' +str(hp)+'хп\
			\n')
			if hp== 70:
				print('--------------------------------------------------------------')
				print('У вас появилась маленькая рана, но вы смогли перебинтоваться')
				print('--------------------------------------------------------------')
			elif hp== 60:
				print('--------------------------------------------------------------')
				print('У вас небольшое головокружение но вы в силах продолжать')
				print('--------------------------------------------------------------')
			elif hp== 40:
				print('--------------------------------------------------------------')
				print('Вы устали')
				print('--------------------------------------------------------------')
			elif hp== 30:
				print('--------------------------------------------------------------')
				print('БОНУС: Вы нашли аптечку и востановили 10 хп')
				print('--------------------------------------------------------------')
				hp=hp+10
			elif hp== 20:
				print('--------------------------------------------------------------')
				print('БОНУС: Вы нашли гранату и кинули её вмонстра, у него отнялось 30 хп')
				print('--------------------------------------------------------------')
				hp2=hp2-20
			elif hp== 7:
				print('--------------------------------------------------------------')
				print('Вы истекаете кровью')
				print('--------------------------------------------------------------')
		y2=y2+1
		print('Попытка №'+str(y2))
		damage2 = random.randint(a,b)
		defense2 = int(input('Сколько раз выстрелить по монстру?:\
			\n')) 
		if defense2!=damage2:
			hp2 = hp2-damage2
			print('Вы успешно попали всеми пулями и нанесли ему:' +str(damage2)+ ' хп\
			\nу монстра осталось:' +str(hp2)+'хп\
			\n')
		elif defense2 == damage2:
			hp2 = hp2+damage2
			print('Монстр уклонился и востановил свои хп на \
				\n' +str(damage2)+'\
			\nтеперь у него:' +str(hp2)+'хп\
			\n')

	if rec < 10:
		print('--------------------------------------------------------------')
		print('ВЫ ПОБИЛИ ПРЕДЫДУЩИЙ РЕКОРД!')
		print('--------------------------------------------------------------')
elif lvl == 'Средняя' or lvl=='средняя':
	hp=150
	hp2=150
	a=0
	b=25

	y= 0
	y2= 0
	while hp>0 or hp2>0:
		y=y+1
		print('Попытка №'+str(y))
		damage = random.randint (a,b)
		defense = int(input('Для отрожения атаки укажите уровень защиты от 1-'+str(b)+'\
			\n')) 
		if defense < b:
			print('Ошибка 05')
			hp = -1
			hp2 = -1

		if defense!=damage:
			hp = hp-damage
			print('Вы не смогли защититься от монстра, он нанёс вам:' +str(damage)+'\
			\nу вас осталось:' +str(hp)+'хп\
			\n')
		elif defense == damage:
			hp = hp+damage
			print('Вы смогли защититься от монтсра, вы выпили \
				\nтаблетки и изличились на:' +str(damage)+'\
			\nу вас стало:' +str(hp)+'хп\
			\n')
			if hp== 70:
				print('--------------------------------------------------------------')
				print('У вас появилась маленькая рана, но вы смогли перебинтоваться')
				print('--------------------------------------------------------------')
			elif hp== 60:
				print('--------------------------------------------------------------')
				print('У вас небольшое головокружение но вы в силах продолжать')
				print('--------------------------------------------------------------')
			elif hp== 40:
				print('--------------------------------------------------------------')
				print('Вы устали')
				print('--------------------------------------------------------------')
			elif hp== 30:
				print('--------------------------------------------------------------')
				print('БОНУС: Вы нашли аптечку и востановили 10 хп')
				print('--------------------------------------------------------------')
				hp=hp+10
			elif hp== 20:
				print('--------------------------------------------------------------')
				print('БОНУС: Вы нашли гранату и кинули её вмонстра, у него отнялось 30 хп')
				print('--------------------------------------------------------------')
				hp2=hp2-20
			elif hp== 7:
				print('--------------------------------------------------------------')
				print('Вы истекаете кровью')
				print('--------------------------------------------------------------')
		y2=y2+1
		print('Попытка №'+str(y2))
		damage2 = random.randint(a,b)
		defense2 = int(input('Сколько раз выстрелить по монстру?:\
			\n')) 
		if defense2!=damage2:
			hp2 = hp2-damage2
			print('Вы успешно попали всеми пулями и нанесли ему:' +str(damage2)+ ' хп\
			\nу монстра осталось:' +str(hp2)+'хп\
			\n')
		elif defense2 == damage2:
			hp2 = hp2+damage2
			print('Монстр уклонился и востановил свои хп на \
				\n' +str(damage2)+'\
			\nтеперь у него:' +str(hp2)+'хп\
			\n')

	if rec < 10:
		print('--------------------------------------------------------------')
		print('ВЫ ПОБИЛИ ПРЕДЫДУЩИЙ РЕКОРД!')
		print('--------------------------------------------------------------')
elif lvl == 'Сложная' or lvl=='сложная':
	hp=100
	hp2=200
	a=0
	b=40
	y= 0
	y2= 0
	while hp>0 or hp2>0:
		y=y+1
		print('Попытка №'+str(y))
		damage = random.randint (a,b)
		defense = int(input('Для отрожения атаки укажите уровень защиты от 1-'+str(b)+'\
			\n')) 
		if defense < b:
			print('Ошибка 05')
			hp = -1
			hp2 = -1

		if defense!=damage:
			hp = hp-damage
			print('Вы не смогли защититься от монстра, он нанёс вам:' +str(damage)+'\
			\nу вас осталось:' +str(hp)+'хп\
			\n')
		elif defense == damage:
			hp = hp+damage
			print('Вы смогли защититься от монтсра, вы выпили \
				\nтаблетки и изличились на:' +str(damage)+'\
			\nу вас стало:' +str(hp)+'хп\
			\n')
			if hp== 70:
				print('--------------------------------------------------------------')
				print('У вас появилась маленькая рана, но вы смогли перебинтоваться')
				print('--------------------------------------------------------------')
			elif hp== 60:
				print('--------------------------------------------------------------')
				print('У вас небольшое головокружение но вы в силах продолжать')
				print('--------------------------------------------------------------')
			elif hp== 40:
				print('--------------------------------------------------------------')
				print('Вы устали')
				print('--------------------------------------------------------------')
			elif hp== 30:
				print('--------------------------------------------------------------')
				print('БОНУС: Вы нашли аптечку и востановили 10 хп')
				print('--------------------------------------------------------------')
				hp=hp+10
			elif hp== 20:
				print('--------------------------------------------------------------')
				print('БОНУС: Вы нашли гранату и кинули её вмонстра, у него отнялось 30 хп')
				print('--------------------------------------------------------------')
				hp2=hp2-20
			elif hp== 7:
				print('--------------------------------------------------------------')
				print('Вы истекаете кровью')
				print('--------------------------------------------------------------')
		y2=y2+1
		print('Попытка №'+str(y2))
		damage2 = random.randint(a,b)
		defense2 = int(input('Сколько раз выстрелить по монстру?:\
			\n')) 
		if defense2!=damage2:
			hp2 = hp2-damage2
			print('Вы успешно попали всеми пулями и нанесли ему:' +str(damage2)+ ' хп\
			\nу монстра осталось:' +str(hp2)+'хп\
			\n')
		elif defense2 == damage2:
			hp2 = hp2+damage2
			print('Монстр уклонился и востановил свои хп на \
				\n' +str(damage2)+'\
			\nтеперь у него:' +str(hp2)+'хп\
			\n')

	if rec < 10:
		print('--------------------------------------------------------------')
		print('ВЫ ПОБИЛИ ПРЕДЫДУЩИЙ РЕКОРД!')
		print('--------------------------------------------------------------')
else: 
	print ('Эта сложность еще не добавленна')

print('Вы прожили '+ str(y2) +' раундов')
input('Нажмите Enter для завершения')
 

